Revit 2027 API
View3D.HideGridsOnLevel Method
 This method hides the grid lines in this 3D view on the given Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideGridsOnLevel(
	ElementId levelId
)
Public Sub HideGridsOnLevel (
	levelId As ElementId
)
public:
void HideGridsOnLevel(
	ElementId^ levelId
)
member HideGridsOnLevel :
        levelId : ElementId -> unit
Parameters
levelId ElementId
 The id of the Level where grids will not be displayed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace